all-blog.org
#+hugo_base_dir: ~/myblog/
#+hugo_section: post
#+hugo_auto_set_lastmode: t
#+hugo_custom_front_matter: :author "Chris Ng"
#+hugo_code fence: nil
#+options: author:nil
#+STARTUP: logdrawer

** DONE orgmode 显示数学公式                         :Emacs:Org_Mode:Mathjax:
:PROPERTIES:
:EXPORT_FILE_NAME: orgmode-显示数学公式
:EXPORT_DATE: 2025-06-06
:EXPORT_HUGO_CATEGORIES: Emacs
:END:
在使用Emacs前习惯使用Markdown来记笔记，使用Typora所见即所得的方式，又或者是使用Vscode的preview插件来实时查看数学公式，但是切换到Emacs的Org Mode后，显示数学公式似乎很困难，经过我的探索，总结出了几个比较好用的 ~Org Mode~ 显示数学公式的方式

*** 使用 org-letex-impatient 实时显示公式

这个教程介绍 ~org-latex-impatient~ ，这个插件的主要原理是使用 Mathjax 的 ~tex2svg~ 命令生成svg图像来实现实时预览，具体可以查看链接 [[eww:https://github.com/yangsheng6810/org-latex-impatient][org-latex-impatient]]


**** Installation

官方教程中介绍的方法是安装 ~mathjax-node-cli~ ，借助命令 ~tex2svg~ 来实现预览，但是在实操中发现失败，因为 ~mathjax-node-cli~ 这个项目太老了，已被归档不再更新， ~Mathjax V3~ 提供了类似的功能，下面的教程主要介绍如何使用 ~mathjax v3~ 配置 ~org-latex-impatient~ 。下面的教程在mac下进行，linux的教程类似，请自行探索。

***** 安装 Node.js

#+BEGIN_SRC shell
brew install node
#+END_SRC

