public/post/orgmode-显示数学公式/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <title>orgmode 显示数学公式 - Chris &#39;s Blog</title>
  <meta name="renderer" content="webkit" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>

<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />

<meta name="theme-color" content="#f8f5ec" />
<meta name="msapplication-navbutton-color" content="#f8f5ec">
<meta name="apple-mobile-web-app-capable" content="yes">
<meta name="apple-mobile-web-app-status-bar-style" content="#f8f5ec">


<meta name="author" content="Chris Ng" /><meta name="description" content="在使用Emacs前习惯使用Markdown来记笔记，使用Typora所见即所得的方式，又或者是使用Vscode的preview插件来实时查看数学公式，但是切换到Emacs的Org Mode后，显示数学公式似乎很困难，经过我的探索，总结出了几个比较好用的 Org Mode 显示数学公式的方式
" /><meta name="keywords" content="Hugo, theme, even" />






<meta name="generator" content="Hugo 0.147.8 with theme even" />


<link rel="canonical" href="http://localhost:1313/post/orgmode-%E6%98%BE%E7%A4%BA%E6%95%B0%E5%AD%A6%E5%85%AC%E5%BC%8F/" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/manifest.json">
<link rel="mask-icon" href="/safari-pinned-tab.svg" color="#5bbad5">



<link href="/sass/main.min.a1db14b6e84e8f090408306914864cc22490babc1818d4b1260b716b5ac1a4cc.css" rel="stylesheet">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/@fancyapps/fancybox@3.1.20/dist/jquery.fancybox.min.css" integrity="sha256-7TyXnr2YU040zfSP+rEcz29ggW4j56/ujTPwjMzyqFY=" crossorigin="anonymous">


<meta property="og:url" content="http://localhost:1313/post/orgmode-%E6%98%BE%E7%A4%BA%E6%95%B0%E5%AD%A6%E5%85%AC%E5%BC%8F/">
  <meta property="og:site_name" content="Chris &#39;s Blog">
  <meta property="og:title" content="orgmode 显示数学公式">
  <meta property="og:description" content="在使用Emacs前习惯使用Markdown来记笔记，使用Typora所见即所得的方式，又或者是使用Vscode的preview插件来实时查看数学公式，但是切换到Emacs的Org Mode后，显示数学公式似乎很困难，经过我的探索，总结出了几个比较好用的 Org Mode 显示数学公式的方式">
  <meta property="og:locale" content="en">
  <meta property="og:type" content="article">
    <meta property="article:section" content="post">
    <meta property="article:published_time" content="2025-06-06T00:00:00+00:00">
    <meta property="article:modified_time" content="2025-06-06T00:00:00+00:00">
    <meta property="article:tag" content="Emacs">
    <meta property="article:tag" content="Org-Mode">
    <meta property="article:tag" content="Mathjax">

  <meta itemprop="name" content="orgmode 显示数学公式">
  <meta itemprop="description" content="在使用Emacs前习惯使用Markdown来记笔记，使用Typora所见即所得的方式，又或者是使用Vscode的preview插件来实时查看数学公式，但是切换到Emacs的Org Mode后，显示数学公式似乎很困难，经过我的探索，总结出了几个比较好用的 Org Mode 显示数学公式的方式">
  <meta itemprop="datePublished" content="2025-06-06T00:00:00+00:00">
  <meta itemprop="dateModified" content="2025-06-06T00:00:00+00:00">
  <meta itemprop="wordCount" content="1483">
  <meta itemprop="keywords" content="Emacs,Org-Mode,Mathjax">
  <meta name="twitter:card" content="summary">
  <meta name="twitter:title" content="orgmode 显示数学公式">
  <meta name="twitter:description" content="在使用Emacs前习惯使用Markdown来记笔记，使用Typora所见即所得的方式，又或者是使用Vscode的preview插件来实时查看数学公式，但是切换到Emacs的Org Mode后，显示数学公式似乎很困难，经过我的探索，总结出了几个比较好用的 Org Mode 显示数学公式的方式">

<!--[if lte IE 9]>
<![endif]-->

<!--[if lt IE 9]>
<![endif]-->

</head>
<body>
  <div id="mobile-navbar" class="mobile-navbar">
  <div class="mobile-header-logo">
    <a href="/" class="logo">Chris&#39;s Blog</a>
  </div>
  <div class="mobile-navbar-icon">
    <span></span>
    <span></span>
    <span></span>
  </div>
</div>
<nav id="mobile-menu" class="mobile-menu slideout-menu">
  <ul class="mobile-menu-list">
    <a href="/">
        <li class="mobile-menu-item">Home</li>
      </a><a href="/post/">
        <li class="mobile-menu-item">Archives</li>
      </a><a href="/tags/">
        <li class="mobile-menu-item">Tags</li>
      </a><a href="/categories/">
        <li class="mobile-menu-item">Categories</li>
      </a><a href="/about/">
        <li class="mobile-menu-item">About</li>
      </a>
  </ul>

  


</nav>

  <div class="container" id="mobile-panel">
    <header id="header" class="header">
        <div class="logo-wrapper">
  <a href="/" class="logo">Chris&#39;s Blog</a>
</div>





<nav class="site-navbar">
  <ul id="menu" class="menu">
    <li class="menu-item">
        <a class="menu-item-link" href="/">Home</a>
      </li><li class="menu-item">
        <a class="menu-item-link" href="/post/">Archives</a>
      </li><li class="menu-item">
        <a class="menu-item-link" href="/tags/">Tags</a>
      </li><li class="menu-item">
        <a class="menu-item-link" href="/categories/">Categories</a>
      </li><li class="menu-item">
        <a class="menu-item-link" href="/about/">About</a>
      </li>
  </ul>
</nav>

    </header>

    <main id="main" class="main">
      <div class="content-wrapper">
        <div id="content" class="content">
          <article class="post">
    
    <header class="post-header">
      <h1 class="post-title">orgmode 显示数学公式</h1>

      <div class="post-meta">
        <span class="post-time"> 2025-06-06 </span>
        <div class="post-category">
            <a href="/categories/emacs/"> Emacs </a>
            </div>
        
      </div>
    </header>

    <div class="post-toc" id="post-toc">
  <h2 class="post-toc-title">Contents</h2>
  <div class="post-toc-content always-active">
    <nav id="TableOfContents">
  <ul>
    <li>
      <ul>
        <li><a href="#使用-org-letex-impatient-实时显示公式">使用 org-letex-impatient 实时显示公式</a>
          <ul>
            <li><a href="#installation">Installation</a></li>
          </ul>
        </li>
        <li><a href="#org-导出-html-渲染latex公式">org 导出 html 渲染latex公式</a></li>
        <li><a href="#所见即所得-org-fragtog">所见即所得 <code>org-fragtog</code></a></li>
      </ul>
    </li>
  </ul>
</nav>
  </div>
</div>
    <div class="post-content">
      <p>在使用Emacs前习惯使用Markdown来记笔记，使用Typora所见即所得的方式，又或者是使用Vscode的preview插件来实时查看数学公式，但是切换到Emacs的Org Mode后，显示数学公式似乎很困难，经过我的探索，总结出了几个比较好用的 <code>Org Mode</code> 显示数学公式的方式</p>
<h2 id="使用-org-letex-impatient-实时显示公式">使用 org-letex-impatient 实时显示公式</h2>
<p>这个教程介绍 <code>org-latex-impatient</code> ，这个插件的主要原理是使用 Mathjax 的 <code>tex2svg</code> 命令生成svg图像来实现实时预览，具体可以查看链接 <a href="https://github.com/yangsheng6810/org-latex-impatient">org-latex-impatient</a></p>
<h3 id="installation">Installation</h3>
<p>官方教程中介绍的方法是安装 <code>mathjax-node-cli</code> ，借助命令 <code>tex2svg</code> 来实现预览，但是在实操中发现失败，因为 <code>mathjax-node-cli</code> 这个项目太老了，已被归档不再更新， <code>Mathjax V3</code> 提供了类似的功能，下面的教程主要介绍如何使用 <code>mathjax v3</code> 配置 <code>org-latex-impatient</code> 。下面的教程在mac下进行，linux的教程类似，请自行探索。</p>
<h4 id="安装-node-dot-js">安装 Node.js</h4>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl">brew install node
</span></span></code></pre></td></tr></table>
</div>
</div><h4 id="自定义转化工具">自定义转化工具</h4>
