all-blog.org
***** 自定义转化工具

在随机的一个目录下创建一个项目文件夹

#+BEGIN_SRC shell
mkdir ~/script/mathjax-converter
cd ~/script/mathjax-converter
#+END_SRC

初始化一个新的 node.js 项目

#+BEGIN_SRC shell
npm init -y
#+END_SRC

安装 ~Mathjax~

#+BEGIN_SRC shell
npm install mathjax-full
#+END_SRC

在 ~mathjax-converter~ 目录下创建 ~convert.js~ 文件，并复制以下的内容进去。

#+BEGIN_SRC js
  // 导入 MathJax v3 的核心组件
  const { mathjax } = require('mathjax-full/js/mathjax.js');
  const { TeX } = require('mathjax-full/js/input/tex.js');
  const { SVG } = require('mathjax-full/js/output/svg.js');
  const { liteAdaptor } = require('mathjax-full/js/adaptors/liteAdaptor.js');
  const { RegisterHTMLHandler } = require('mathjax-full/js/handlers/html.js');
  
  // 初始化转换环境
  const adaptor = liteAdaptor();
  RegisterHTMLHandler(adaptor);

  const tex = new TeX({ packages: require('mathjax-full/js/input/tex/AllPackages.js').AllPackages });
  const svg = new SVG({ fontCache: 'none' }); // 'none' 表示不缓存字体，更适合命令行一次性使用

  // 创建一个异步函数来执行转换
  async function texToSvg(texInput) {
      const math = await mathjax.document('', {
          InputJax: tex,
          OutputJax: svg
      });
      
      // 将 TeX 转换为 SVG
      const node = math.convert(texInput, {
          display: true, // true 表示显示模式 (display style), false 表示行内模式 (inline style)
          em: 16,
          ex: 8,
          containerWidth: 80 * 16
      });

      // 从结果中提取 SVG 代码并输出
      return adaptor.innerHTML(node);
  }

  // 获取命令行传入的第一个参数作为 TeX 输入
  const texInput = process.argv[2];

  if (!texInput) {
      console.error("用法: node convert.js \"<Your-TeX-String>\"");
      process.exit(1);
  }

  // 运行转换并打印结果到控制台
  texToSvg(texInput).then(svgOutput => {
      console.log(svgOutput);
  }).catch(err => {
      console.error(err);
  });
#+END_SRC

接下来在终端中进行测试，运行下面的命令，当前目录下应该会出现一个svg文件

#+BEGIN_SRC shell
  node convert.js "E = mc^2" > formula.svg    # 简单公式
  node convert.js "\\frac{-b \\pm \\sqrt{b^2-4ac}}{2a}" > quadratic.svg    # 复杂公式
#+END_SRC

查看 ~org-latex-impatient~ 的教程，这个插件主要是依赖svg命令，因此还需要对 ~convert.js~ 文件进行包装，在当前路径先创建 ~tex2svg~ 文件，粘贴以下的内容进去

#+BEGIN_SRC shell
#!/bin/bash

# 这是一个给 Emacs 插件使用的包装脚本。
# 它接收来自 Emacs 的参数，然后传递给我们的 Node.js 脚本。

# 填写你的 convert.js 的绝对路径
NODE_SCRIPT_PATH="/path/to/your/mathjax-converter/convert.js"

# 使用 node 执行脚本, "$@" 会将所有从 Emacs 传来的参数原封不动地传过去
node "$NODE_SCRIPT_PATH" "$@"
#+END_SRC

接下来赋予可执行权限。

#+BEGIN_SRC shell
chmod +x tex2svg
#+END_SRC

然后，即可在命令行中进行测试
#+BEGIN_SRC shell
./tex2svg "E=mc^2"
#+END_SRC

为了方便我们直接调用，我们可以将这个命令放入系统的path路径下

#+BEGIN_SRC shell
sudo cp tex2svg /usr/local/bin
#+END_SRC

重启终端即可在系统中直接正确使用 tex2svg 命令。

