public/post/orgmode-显示数学公式/index.html
<p>在随机的一个目录下创建一个项目文件夹</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl">mkdir ~/script/mathjax-converter
</span></span><span class="line"><span class="cl"><span class="nb">cd</span> ~/script/mathjax-converter
</span></span></code></pre></td></tr></table>
</div>
</div><p>初始化一个新的 node.js 项目</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl">npm init -y
</span></span></code></pre></td></tr></table>
</div>
</div><p>安装 <code>Mathjax</code></p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl">npm install mathjax-full
</span></span></code></pre></td></tr></table>
</div>
</div><p>在 <code>mathjax-converter</code> 目录下创建 <code>convert.js</code> 文件，并复制以下的内容进去。</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span><span class="lnt">22
</span><span class="lnt">23
</span><span class="lnt">24
</span><span class="lnt">25
</span><span class="lnt">26
</span><span class="lnt">27
</span><span class="lnt">28
</span><span class="lnt">29
</span><span class="lnt">30
</span><span class="lnt">31
</span><span class="lnt">32
</span><span class="lnt">33
</span><span class="lnt">34
</span><span class="lnt">35
</span><span class="lnt">36
</span><span class="lnt">37
</span><span class="lnt">38
</span><span class="lnt">39
</span><span class="lnt">40
</span><span class="lnt">41
</span><span class="lnt">42
</span><span class="lnt">43
</span><span class="lnt">44
</span><span class="lnt">45
</span><span class="lnt">46
</span><span class="lnt">47
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-js" data-lang="js"><span class="line"><span class="cl"><span class="c1">// 导入 MathJax v3 的核心组件
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="kr">const</span> <span class="p">{</span> <span class="nx">mathjax</span> <span class="p">}</span> <span class="o">=</span> <span class="nx">require</span><span class="p">(</span><span class="s1">&#39;mathjax-full/js/mathjax.js&#39;</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="kr">const</span> <span class="p">{</span> <span class="nx">TeX</span> <span class="p">}</span> <span class="o">=</span> <span class="nx">require</span><span class="p">(</span><span class="s1">&#39;mathjax-full/js/input/tex.js&#39;</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="kr">const</span> <span class="p">{</span> <span class="nx">SVG</span> <span class="p">}</span> <span class="o">=</span> <span class="nx">require</span><span class="p">(</span><span class="s1">&#39;mathjax-full/js/output/svg.js&#39;</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="kr">const</span> <span class="p">{</span> <span class="nx">liteAdaptor</span> <span class="p">}</span> <span class="o">=</span> <span class="nx">require</span><span class="p">(</span><span class="s1">&#39;mathjax-full/js/adaptors/liteAdaptor.js&#39;</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="kr">const</span> <span class="p">{</span> <span class="nx">RegisterHTMLHandler</span> <span class="p">}</span> <span class="o">=</span> <span class="nx">require</span><span class="p">(</span><span class="s1">&#39;mathjax-full/js/handlers/html.js&#39;</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1">// 初始化转换环境
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="kr">const</span> <span class="nx">adaptor</span> <span class="o">=</span> <span class="nx">liteAdaptor</span><span class="p">();</span>
</span></span><span class="line"><span class="cl"><span class="nx">RegisterHTMLHandler</span><span class="p">(</span><span class="nx">adaptor</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="kr">const</span> <span class="nx">tex</span> <span class="o">=</span> <span class="k">new</span> <span class="nx">TeX</span><span class="p">({</span> <span class="nx">packages</span><span class="o">:</span> <span class="nx">require</span><span class="p">(</span><span class="s1">&#39;mathjax-full/js/input/tex/AllPackages.js&#39;</span><span class="p">).</span><span class="nx">AllPackages</span> <span class="p">});</span>
</span></span><span class="line"><span class="cl"><span class="kr">const</span> <span class="nx">svg</span> <span class="o">=</span> <span class="k">new</span> <span class="nx">SVG</span><span class="p">({</span> <span class="nx">fontCache</span><span class="o">:</span> <span class="s1">&#39;none&#39;</span> <span class="p">});</span> <span class="c1">// &#39;none&#39; 表示不缓存字体，更适合命令行一次性使用
</span></span></span><span class="line"><span class="cl"><span class="c1"></span>
</span></span><span class="line"><span class="cl"><span class="c1">// 创建一个异步函数来执行转换
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="kr">async</span> <span class="kd">function</span> <span class="nx">texToSvg</span><span class="p">(</span><span class="nx">texInput</span><span class="p">)</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="kr">const</span> <span class="nx">math</span> <span class="o">=</span> <span class="kr">await</span> <span class="nx">mathjax</span><span class="p">.</span><span class="nb">document</span><span class="p">(</span><span class="s1">&#39;&#39;</span><span class="p">,</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">        <span class="nx">InputJax</span><span class="o">:</span> <span class="nx">tex</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">        <span class="nx">OutputJax</span><span class="o">:</span> <span class="nx">svg</span>
</span></span><span class="line"><span class="cl">    <span class="p">});</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="c1">// 将 TeX 转换为 SVG
</span></span></span><span class="line"><span class="cl"><span class="c1"></span>    <span class="kr">const</span> <span class="nx">node</span> <span class="o">=</span> <span class="nx">math</span><span class="p">.</span><span class="nx">convert</span><span class="p">(</span><span class="nx">texInput</span><span class="p">,</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">        <span class="nx">display</span><span class="o">:</span> <span class="kc">true</span><span class="p">,</span> <span class="c1">// true 表示显示模式 (display style), false 表示行内模式 (inline style)
</span></span></span><span class="line"><span class="cl"><span class="c1"></span>        <span class="nx">em</span><span class="o">:</span> <span class="mi">16</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">        <span class="nx">ex</span><span class="o">:</span> <span class="mi">8</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">        <span class="nx">containerWidth</span><span class="o">:</span> <span class="mi">80</span> <span class="o">*</span> <span class="mi">16</span>
</span></span><span class="line"><span class="cl">    <span class="p">});</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="c1">// 从结果中提取 SVG 代码并输出
</span></span></span><span class="line"><span class="cl"><span class="c1"></span>    <span class="k">return</span> <span class="nx">adaptor</span><span class="p">.</span><span class="nx">innerHTML</span><span class="p">(</span><span class="nx">node</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1">// 获取命令行传入的第一个参数作为 TeX 输入
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="kr">const</span> <span class="nx">texInput</span> <span class="o">=</span> <span class="nx">process</span><span class="p">.</span><span class="nx">argv</span><span class="p">[</span><span class="mi">2</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">if</span> <span class="p">(</span><span class="o">!</span><span class="nx">texInput</span><span class="p">)</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nx">console</span><span class="p">.</span><span class="nx">error</span><span class="p">(</span><span class="s2">&#34;用法: node convert.js \&#34;&lt;Your-TeX-String&gt;\&#34;&#34;</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="nx">process</span><span class="p">.</span><span class="nx">exit</span><span class="p">(</span><span class="mi">1</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1">// 运行转换并打印结果到控制台
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="nx">texToSvg</span><span class="p">(</span><span class="nx">texInput</span><span class="p">).</span><span class="nx">then</span><span class="p">(</span><span class="nx">svgOutput</span> <span class="p">=&gt;</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">svgOutput</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="p">}).</span><span class="k">catch</span><span class="p">(</span><span class="nx">err</span> <span class="p">=&gt;</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nx">console</span><span class="p">.</span><span class="nx">error</span><span class="p">(</span><span class="nx">err</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="p">});</span>
</span></span></code></pre></td></tr></table>
</div>
</div><p>接下来在终端中进行测试，运行下面的命令，当前目录下应该会出现一个svg文件</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl">node convert.js <span class="s2">&#34;E = mc^2&#34;</span> &gt; formula.svg    <span class="c1"># 简单公式</span>
</span></span><span class="line"><span class="cl">node convert.js <span class="s2">&#34;\\frac{-b \\pm \\sqrt{b^2-4ac}}{2a}&#34;</span> &gt; quadratic.svg    <span class="c1"># 复杂公式</span>
</span></span></code></pre></td></tr></table>
</div>
</div><p>查看 <code>org-latex-impatient</code> 的教程，这个插件主要是依赖svg命令，因此还需要对 <code>convert.js</code> 文件进行包装，在当前路径先创建 <code>tex2svg</code> 文件，粘贴以下的内容进去</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl"><span class="cp">#!/bin/bash
</span></span></span><span class="line"><span class="cl"><span class="cp"></span>
</span></span><span class="line"><span class="cl"><span class="c1"># 这是一个给 Emacs 插件使用的包装脚本。</span>
</span></span><span class="line"><span class="cl"><span class="c1"># 它接收来自 Emacs 的参数，然后传递给我们的 Node.js 脚本。</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># 填写你的 convert.js 的绝对路径</span>
</span></span><span class="line"><span class="cl"><span class="nv">NODE_SCRIPT_PATH</span><span class="o">=</span><span class="s2">&#34;/path/to/your/mathjax-converter/convert.js&#34;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># 使用 node 执行脚本, &#34;$@&#34; 会将所有从 Emacs 传来的参数原封不动地传过去</span>
</span></span><span class="line"><span class="cl">node <span class="s2">&#34;</span><span class="nv">$NODE_SCRIPT_PATH</span><span class="s2">&#34;</span> <span class="s2">&#34;</span><span class="nv">$@</span><span class="s2">&#34;</span>
</span></span></code></pre></td></tr></table>
</div>
</div><p>接下来赋予可执行权限。</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl">chmod +x tex2svg
</span></span></code></pre></td></tr></table>
</div>
</div><p>然后，即可在命令行中进行测试</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl">./tex2svg <span class="s2">&#34;E=mc^2&#34;</span>
</span></span></code></pre></td></tr></table>
</div>
</div><p>为了方便我们直接调用，我们可以将这个命令放入系统的path路径下</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-shell" data-lang="shell"><span class="line"><span class="cl">sudo cp tex2svg /usr/local/bin
</span></span></code></pre></td></tr></table>
</div>
</div><p>重启终端即可在系统中直接正确使用 tex2svg 命令。</p>
