all-blog.org
***** 配置 init.el
在 ~~/.emacs.d/init.el~ 中添加以下的配置

#+BEGIN_SRC emacs-lisp
  (use-package org-latex-impatient
    :defer t  ; 延迟加载，直到需要时才加载
    :hook (org-mode . org-latex-impatient-mode) ; 在打开 Org 文件时自动启用
    :init
    (setq org-latex-impatient-tex2svg-bin
          "/usr/local/bin/tex2svg")) ; 切换成命令的实际绝对路径
#+END_SRC

接下来，应该在编辑org文件的时候，就可以实时查看Emacs了




*** org 导出 html 渲染latex公式

我们使用 ~c-x c-o h o~ 导出网页时，发现导出的网页并不能够实时显示数学公式，实际上，orgmode的官网教程对此有介绍，具体参考 [[eww:https://orgmode.org/manual/Math-formatting-in-HTML-export.html][Math formatting in HTML export]]

只需要在org文件的头部添加以下的内容

#+BEGIN_SRC org
#+HTML_MATHJAX: align: left indent: 5em tagside: left
#+END_SRC

以及下面的命令其中一个即可

#+BEGIN_SRC org
#+OPTIONS: tex:dvipng
#+END_SRC

#+BEGIN_SRC org
#+OPTIONS: tex:dvisvgm
#+END_SRC

在导出的时候即可显示数学公式

*** 所见即所得 ~org-fragtog~

第一种方法介绍了在编辑的过程中实时显示数学公式，那么，有没有一种方法能够实现 Typora 编写数学公式的效果呢？ 答案是有一个插件确实能够实现，具体可以参考[[eww:https://github.com/io12/org-fragtog][org-fragtog]]

只需安装 org-fragtog 插件，然后在 ~init.el~ 添加配置即可

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'org-fragtog-mode)
#+END_SRC

当然，我们不想在使用org后就启动，可以在我们编辑好后，通过 ~M+x org-fragtog~ 来启动。

但是，我发现使用这种方式显示的数学公式会出现过小看不清的问题，可以在 ~init.el~ 添加以下配置进行缩放
#+BEGIN_SRC emacs-lisp
;; 调整 Org Mode LaTeX 片段预览的显示比例
;; 默认值是 1.0 (100%)
;; 1.5 表示放大到 150%，通常是一个比较舒适的大小
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.5))
#+END_SRC
