public/post/orgmode-显示数学公式/index.html
<h4 id="配置-init-dot-el">配置 init.el</h4>
<p>在 <code>~/.emacs.d/init.el</code> 中添加以下的配置</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span><span class="lnt">3
</span><span class="lnt">4
</span><span class="lnt">5
</span><span class="lnt">6
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-emacs-lisp" data-lang="emacs-lisp"><span class="line"><span class="cl"><span class="p">(</span><span class="nb">use-package</span> <span class="nv">org-latex-impatient</span>
</span></span><span class="line"><span class="cl">  <span class="nb">:defer</span> <span class="no">t</span>  <span class="c1">; 延迟加载，直到需要时才加载</span>
</span></span><span class="line"><span class="cl">  <span class="nb">:hook</span> <span class="p">(</span><span class="nv">org-mode</span> <span class="o">.</span> <span class="nv">org-latex-impatient-mode</span><span class="p">)</span> <span class="c1">; 在打开 Org 文件时自动启用</span>
</span></span><span class="line"><span class="cl">  <span class="nb">:init</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nb">setq</span> <span class="nv">org-latex-impatient-tex2svg-bin</span>
</span></span><span class="line"><span class="cl">        <span class="s">&#34;/usr/local/bin/tex2svg&#34;</span><span class="p">))</span> <span class="c1">; 切换成命令的实际绝对路径</span>
</span></span></code></pre></td></tr></table>
</div>
</div><p>接下来，应该在编辑org文件的时候，就可以实时查看Emacs了</p>
<h2 id="org-导出-html-渲染latex公式">org 导出 html 渲染latex公式</h2>
<p>我们使用 <code>c-x c-o h o</code> 导出网页时，发现导出的网页并不能够实时显示数学公式，实际上，orgmode的官网教程对此有介绍，具体参考 <a href="https://orgmode.org/manual/Math-formatting-in-HTML-export.html">Math formatting in HTML export</a></p>
<p>只需要在org文件的头部添加以下的内容</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-org" data-lang="org"><span class="line"><span class="cl"><span class="cs">#+HTML_MATHJAX</span><span class="c">: align: left indent: 5em tagside: left</span>
</span></span></code></pre></td></tr></table>
</div>
</div><p>以及下面的命令其中一个即可</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-org" data-lang="org"><span class="line"><span class="cl"><span class="cs">#+OPTIONS</span><span class="c">: tex:dvipng</span>
</span></span></code></pre></td></tr></table>
</div>
</div><div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-org" data-lang="org"><span class="line"><span class="cl"><span class="cs">#+OPTIONS</span><span class="c">: tex:dvisvgm</span>
</span></span></code></pre></td></tr></table>
</div>
</div><p>在导出的时候即可显示数学公式</p>
<h2 id="所见即所得-org-fragtog">所见即所得 <code>org-fragtog</code></h2>
<p>第一种方法介绍了在编辑的过程中实时显示数学公式，那么，有没有一种方法能够实现 Typora 编写数学公式的效果呢？ 答案是有一个插件确实能够实现，具体可以参考<a href="https://github.com/io12/org-fragtog">org-fragtog</a></p>
<p>只需安装 org-fragtog 插件，然后在 <code>init.el</code> 添加配置即可</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-emacs-lisp" data-lang="emacs-lisp"><span class="line"><span class="cl"><span class="p">(</span><span class="nv">add-hook</span> <span class="ss">&#39;org-mode-hook</span> <span class="ss">&#39;org-fragtog-mode</span><span class="p">)</span>
</span></span></code></pre></td></tr></table>
</div>
</div><p>当然，我们不想在使用org后就启动，可以在我们编辑好后，通过 <code>M+x org-fragtog</code> 来启动。</p>
<p>但是，我发现使用这种方式显示的数学公式会出现过小看不清的问题，可以在 <code>init.el</code> 添加以下配置进行缩放</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span><span class="lnt">3
</span><span class="lnt">4
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-emacs-lisp" data-lang="emacs-lisp"><span class="line"><span class="cl"><span class="c1">;; 调整 Org Mode LaTeX 片段预览的显示比例</span>
</span></span><span class="line"><span class="cl"><span class="c1">;; 默认值是 1.0 (100%)</span>
</span></span><span class="line"><span class="cl"><span class="c1">;; 1.5 表示放大到 150%，通常是一个比较舒适的大小</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="nb">setq</span> <span class="nv">org-format-latex-options</span> <span class="p">(</span><span class="nf">plist-put</span> <span class="nv">org-format-latex-options</span> <span class="nb">:scale</span> <span class="mf">1.5</span><span class="p">))</span>
</span></span></code></pre></td></tr></table>
</div>
</div>
    </div>

    <div class="post-copyright">
  <p class="copyright-item">
    <span class="item-title">Author</span>
    <span class="item-content">Chris Ng</span>
  </p>
  <p class="copyright-item">
    <span class="item-title">LastMod</span>
    <span class="item-content">
        2025-06-06
        
    </span>
  </p>
  
  
</div>
<footer class="post-footer">
      <div class="post-tags">
          <a href="/tags/emacs/">Emacs</a>
          <a href="/tags/org-mode/">Org-Mode</a>
          <a href="/tags/mathjax/">Mathjax</a>
          </div>
      <nav class="post-nav">
        <a class="prev" href="/post/%E5%A4%9C%E7%88%AC%E7%99%BD%E4%BA%91%E5%B1%B1/">
            <i class="iconfont icon-left"></i>
            <span class="prev-text nav-default">夜爬白云山</span>
            <span class="prev-text nav-mobile">Prev</span>
          </a>
        <a class="next" href="/post/linux%E6%9C%8D%E5%8A%A1%E5%99%A8%E4%BB%A3%E7%90%86-web-ui/">
            <span class="next-text nav-default">Linux服务器代理 (Web UI)</span>
            <span class="next-text nav-mobile">Next</span>
            <i class="iconfont icon-right"></i>
          </a>
      </nav>
    </footer>
  </article>
        </div>
        

  

  

      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="social-links">
      <a href="chrisng2008@163.com" class="iconfont icon-email" title="email"></a>
      <a href="https://x.com/ChrisNg769261" class="iconfont icon-twitter" title="twitter"></a>
      <a href="https://www.facebook.com/profile.php?id=100083762033288" class="iconfont icon-facebook" title="facebook"></a>
      <a href="https://www.google.com/" class="iconfont icon-google" title="google"></a>
      <a href="https://github.com/chrisng2008" class="iconfont icon-github" title="github"></a>
      <a href="https://space.bilibili.com/233895773?spm_id_from=333.1007.0.0" class="iconfont icon-bilibili" title="bilibili"></a>
  
</div>

<div class="copyright">
  <span class="power-by">
    Powered by <a class="hexo-link" href="https://gohugo.io">Hugo</a>
  </span>
  <span class="division">|</span>
  <span class="theme-info">
    Theme - 
    <a class="theme-link" href="https://github.com/olOwOlo/hugo-theme-even">Even</a>
  </span>

  

  <span class="copyright-year">
    &copy; 
    2025<span class="heart"><i class="iconfont icon-heart"></i></span><span></span>
  </span>
</div>

    </footer>

    <div class="back-to-top" id="back-to-top">
      <i class="iconfont icon-up"></i>
    </div>
  </div>
  
  <script src="https://cdn.jsdelivr.net/npm/jquery@3.2.1/dist/jquery.min.js" integrity="sha256-hwg4gsxgFZhOsEEamdOYGBf13FyQuiTwlAQgxVSNgt4=" crossorigin="anonymous"></script>
  <script src="https://cdn.jsdelivr.net/npm/slideout@1.0.1/dist/slideout.min.js" integrity="sha256-t+zJ/g8/KXIJMjSVQdnibt4dlaDxc9zXr/9oNPeWqdg=" crossorigin="anonymous"></script>
  <script src="https://cdn.jsdelivr.net/npm/@fancyapps/fancybox@3.1.20/dist/jquery.fancybox.min.js" integrity="sha256-XVLffZaxoWfGUEbdzuLi7pwaUJv1cecsQJQqGLe7axY=" crossorigin="anonymous"></script>



<script type="text/javascript" src="/js/main.min.4ae89da218555efa0e7093a20b92017d2e1202b66fff9fc2edf4cb8d44b44c6e.js"></script>
  <script type="text/javascript">
    window.MathJax = {
      tex: {
        inlineMath: [['$','$'], ['\\(','\\)']],
        tags: 'ams',
        }
    };
  </script>
  <script async src="https://cdn.jsdelivr.net/npm/mathjax@3.0.5/es5/tex-mml-chtml.js" integrity="sha256-HGLuEfFcsUJGhvB8cQ8nr0gai9EucOOaIxFw7qxmd+w=" crossorigin="anonymous"></script>








</body>
</html>
